{"error_groups": [{"name": "UnusedPrivateField", "description": "Detects when a private field is declared and/or assigned a value, but not used."}, {"name": "UnusedLocalVariable", "description": "Detects when a local variable is declared and/or assigned, but not used."}, {"name": "UnusedPrivateMethod", "description": "Unused Private Method detects when a private method is declared but is unused."}, {"name": "UnusedFormalParameter", "description": "Avoid passing parameters to methods or constructors and then not using those parameters."}, {"name": "CyclomaticComplexity", "description": "Complexity is determined by the number of decision points in a method plus one for the\nmethod entry.  The decision points are 'if', 'while', 'for', and 'case labels'.  Generally,\n1-4 is low complexity, 5-7 indicates moderate complexity, 8-10 is high complexity,\n and 11+ is very high complexity."}, {"name": "NPathComplexity", "description": "The NPath complexity of a method is the number of acyclic execution paths through that method.\nA threshold of 200 is generally considered the point where measures should be taken to reduce complexity."}, {"name": "ExcessiveMethodLength", "description": "Violations of this rule usually indicate that the method is doing\ntoo much.  Try to reduce the method size by creating helper methods and removing any copy/pasted code."}, {"name": "ExcessiveClassLength", "description": "Long Class files are indications that the class may be trying to\ndo too much.  Try to break it down, and reduce the size to something\nmanageable."}, {"name": "ExcessiveParameterList", "description": "Long parameter lists can indicate that a new object should be created to\nwrap the numerous parameters.  Basically, try to group the parameters together."}, {"name": "ExcessivePublicCount", "description": "A large number of public methods and attributes declared in a class can indicate\nthe class may need to be broken up as increased effort will be required to\nthoroughly test it."}, {"name": "TooManyFields", "description": "Classes that have too many fields could be redesigned to have fewer fields,\npossibly through some nested object grouping of some of the information. For\nexample, a class with city/state/zip fields could instead have one Address\nfield."}, {"name": "TooManyMethods", "description": "A class with too many methods is probably a good suspect for refactoring, in\norder to reduce its complexity and find a way to have more fine grained objects."}, {"name": "ExcessiveClassComplexity", "description": "The WMC of a class is a good indicator of how much time and effort is required\nto modify and maintain this class. A large number of methods also means that\nthis class has a greater potential impact on derived classes."}, {"name": "ShortVariable", "description": "Detects when a field, local, or parameter has a very short name."}, {"name": "LongVariable", "description": "Detects when a field, formal or local variable is declared with a long name."}, {"name": "ShortMethodName", "description": "Detects when very short method names are used."}, {"name": "ConstructorWithNameAsEnclosingClass", "description": "A constructor method should not have the same name as the enclosing class, consider\nto use the PHP 5 __construct method."}, {"name": "ConstantNamingConventions", "description": "Class/Interface constant nanmes should always be defined in uppercase."}, {"name": "BooleanGetMethodName", "description": "Looks for methods named 'getX()' with 'boolean' as the return type. The convention\nis to name these methods 'isX()' or 'hasX()'."}, {"name": "Superglobals", "description": "Accessing a super-global variable directly is considered a bad practice.\nThese variables should be encapsulated in objects that are provided by a framework, for instance."}, {"name": "CamelCaseClassName", "description": "It is considered best practice to use the CamelCase notation to name classes."}, {"name": "CamelCasePropertyName", "description": "It is considered best practice to use the camelCase notation to name attributes."}, {"name": "CamelCaseMethodName", "description": "It is considered best practice to use the CamelCase notation to name methods."}, {"name": "CamelCaseParameterName", "description": "It is considered best practice to use the camelCase notation to name parameters."}, {"name": "CamelCaseVariableName", "description": "It is considered best practice to use the camelCase notation to name variables."}, {"name": "BooleanArgumentFlag", "description": "A boolean flag argument is a reliable indicator for a violation of\nthe Single Responsibility Principle (SRP). You can fix this problem\nby extracting the logic in the boolean flag into its own class\nor method."}, {"name": "ElseExpression", "description": "An if expression with an else branch is never necessary. You can rewrite the\nconditions in a way that the else is not necessary and the code becomes simpler\nto read.  To achieve this use early return statements. To achieve this you may\nneed to split the code it several smaller methods. For very simple assignments\nyou could also use the ternary operations."}, {"name": "StaticAccess", "description": "Static acccess causes inexchangable dependencies to other classes and leads to hard to test code. Avoid\nusing static access at all costs and instead inject dependencies through the constructor. The only\ncase when static access is acceptable is when used for factory methods."}, {"name": "ExitExpression", "description": "An exit-expression within regular code is untestable and therefore it should\nbe avoided. Consider to move the exit-expression into some kind of startup\nscript where an error/exception code is returned to the calling environment."}, {"name": "EvalExpression", "description": "An eval-expression is untestable, a security risk and bad practice. Therefore\nit should be avoided. Consider to replace the eval-expression with regular\ncode."}, {"name": "GotoStatement", "description": "Goto makes code harder to read and it is nearly impossible to understand the\ncontrol flow of an application that uses this language construct. Therefore it\nshould be avoided. Consider to replace Goto with regular control structures and\nseparate methods/function, which are easier to read."}, {"name": "NumberOfChildren", "description": "A class with an excessive number of children is an indicator for an unbalanced\nclass hierarchy. You should consider to refactor this class hierarchy."}, {"name": "DepthOfInheritance", "description": "A class with many parents is an indicator for an unbalanced and wrong class\nhierarchy. You should consider to refactor this class hierarchy."}, {"name": "CouplingBetweenObjects", "description": "A class with to many dependencies has negative impacts on several quality\naspects of a class. This includes quality criterias like stability,\nmaintainability and understandability"}]}
